KZ = 0
RU = 1
EN = 2

KZ_CHOICE = "Қазақша🇰🇿"
RU_CHOICE = "Русский🇷🇺"
EN_CHOICE = "English🇬🇧"

LANGUAGE_CHOICE_TEXT = KZ_CHOICE + " / " + RU_CHOICE + " / " + EN_CHOICE

WELCOME = [
    "Сәлем! 👋",
    "Привет! 👋",
    "Hello! 👋"
]

ABOUT = [
    "Бұл бот Атырау қаласындағы Назарбаев Зияткерлік Мектептің кітапханасындағы кітаптардың тізімін көрсетеді.",
    "Этот бот показывает список книг в библиотеке Назарбаев Интеллектуальной Школы города Атырау.",
    "This bot shows the list of books in the library of Nazarbayev Intellectual School of Atyrau."
]

SEARCH = [
    "Аты бойынша кітап іздеу 📕",
    "Поиск книг по имени 📗",
    "Search book by name 📘"
]

QUERY = [
    "🔍 Сіздің іздегеніңіз: ",
    "🔍 Вы искали: ",
    "🔍 You've searched for: "
]

QUERY_TOO_LONG = [
    "🚫 Сұраныс өте ұзын",
    "🚫 Запрос слишком длинный",
    "🚫 Query too long"
]

SEARCH_BY_CATEGORY = [
    "Санаттар бойынша кітап іздеу 📚",
    "Поиск книг по категории 📚",
    "Search book by category 📚"
]

CHANGE_LANGUAGE = [
    "Тілді ауыстыру 💬",
    "Сменить язык 💬",
    "Change language 💬"
]

TECH_SUPPORT = [
    "Техникалық көмек 👨‍💻",
    "Техническая поддержка 👨‍💻",
    "Technical support 👨‍💻"
]

THY_TECH_SUPPORT_GUY = "https://t.me/danqzq"

ENTER_BOOK_NAME = [
    "Кітап атауын енгізіңіз... ✍️",
    "Введите название книги... ✍️",
    "Enter a book name... ✍️"
]

SELECT_CATEGORY = [
    "Категорияны таңдаңыз",
    "Выберите категорию",
    "Select category"
]

BACK_TO_MAIN_MENU = [
    "Басты бет 🔙",
    "Главное меню 🔙",
    "Main menu 🔙"
]

BOOK_NOT_FOUND = [
    "Кітап табылмады 🤷",
    "Книга не найдена 🤷",
    "Book not found 🤷"
]

FIND_OTHER_BOOK = [
    "Басқа кітап іздеу",
    "Поиск другой книги",
    "Find another book"
]

YOU_REACHED_THE_START = [
    "Беттің басына жеттіңіз",
    "Вы дошли до начала",
    "You've reached the start"
]

YOU_REACHED_THE_END = [
    "Беттің соңына жеттіңіз",
    "Вы дошли до последней страницы",
    "You've reached the last page"
]

BOOK_NAME = [
    "Атауы: ",
    "Название: ",
    "Name: "
]

BOOK_AUTHOR = [
    "Авторлары: ",
    "Авторы: ",
    "Authors: "
]

BOOK_PUBLISHER = [
    "Жарияланған: ",
    "Издательство: ",
    "Publisher: "
]

BOOK_YEAR = [
    "Жарияланған жылы: ",
    "Год издания: ",
    "Year: "
]

BOOK_CATEGORY = [
    "Категория: ",
    "Категория: ",
    "Category: "
]

BOOK_PLACE = [
    "Жасалған жері: ",
    "Место издания: ",
    "Place of making: "
]

BOOK_QUANTITY = [
    "Кітапханадағы даналар саны: ",
    "Количество экземпляров в библиотеке: ",
    "Quantity of copies in library: "
]

CATEGORIES = [[
    "Қазақ тіліндегі қосымша әдебиеттер",
    "Орыс тіліндегі қосымша әдебиеттер",
    "Өзге тілдегі қосымша әдебиеттер",
    "Қазақ тіліндегі әдістемелік құралдар",
    "Орыс тіліндегі әдістемелік құралдар",
    "Өзге тілдегі әдістемелік құралдар",
    "Қазақ тіліндегі сөздіктер",
    "Орыс тіліндегі сөздіктер",
    "Өзге тілдегі сөздіктер",
    "Қазақ тіліндегі көркем әдебиет",
    "Орыс тіліндегі көркем әдебиет",
    "Өзге тілдегі көркем әдебиет",
    "Электрондық жасамалар",
    "Қазақ тіліндегі энциклопедиялар",
    "Орыс тіліндегі энциклопедиялар",
    "Өзге тілдегі энциклопедиялар"
],[
    "Дополнительная литература на казахском языке",
    "Дополнительная литература на русском языке",
    "Дополнительная литература на других языках",
    "Методические пособия на казахском языке",
    "Методические пособия на русском языке",
    "Методические пособия на других языках",
    "Словари на казахском языке",
    "Словари на русском языке",
    "Словари на других языках",
    "Художественная литература на казахском языке",
    "Художественная литература на русском языке",
    "Художественная литература на других языках",
    "Электронные издания",
    "Энциклопедии на казахском языке",
    "Энциклопедии на русском языке",
    "Энциклопедии на других языках"
],[
    "Additional literature in kaz. lang.",
    "Additional literature in rus. lang.",
    "Additional literature in other lang.",
    "Methodological manuals in kaz. lang.",
    "Methodological manuals in rus. lang.",
    "Methodological manuals in other lang.",
    "Dictionaries in kaz. lang.",
    "Dictionaries in rus. lang.",
    "Dictionaries in other lang.",
    "Fictional literature in kaz. lang.",
    "Fictional literature in rus. lang.",
    "Fictional literature in other lang.",
    "Digital publications",
    "Encyclopedias in kaz. lang.",
    "Encyclopedias in rus. lang.",
    "Encyclopedias in other lang."
]]

COMMANDS = [
    "search",
    "categories",
    "language",
    "mainmenu"
]

COMMAND_DESCRIPTIONS = [[
    "Аты бойынша кітап іздеу",
    "Санаттар бойынша кітап іздеу",
    "Тіл ауыстыру",
    "Басты бетке қайта оралу"
],[
    "Поиск книг по имени",
    "Поиск книг по категориям",
    "Сменить язык",
    "Обратно в главное меню"
], [
    "Search for books by name",
    "Search for books by categories",
    "Change the language of bot",
    "Go back to main menu"
]]
